#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    int i = 1;
    printf("1左移一位的结果为:%d\n", i << 1);

    i = 0x80000000;
    printf("0x%x左移一位为:%d\n", i, i << 1);
    //左移:当为有符号数时,符号位会被移出
    //因为0x80000000 的二进制形式为:
    //10000000 00000000 00000000 00000000, 左移一位后变为:
    //00000000 00000000 00000000 00000000

    i = 1;
    printf("1左移33位为:%d\n", i << 33);//会给出警告,33 % 32 = 1 左移1位,i变成2

    //右移不同，对于有符号数来说,右移会保持符号位不变
    i = 0x80000000;
    printf("0x%x右移一位为:%d\n", i, i >> 1);

    exit(0);
}
